In [52]:
import pandas as pd

# Practice problem IV

In [88]:
# load the occupation dataset
url = 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/users.csv'
users = pd.read_csv(url, index_col='user_id')

Display the first 10 entries of the dataset

In [90]:
users.head(10)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703

What is the number of observations (rows) in the dataset?

In [11]:
users.index.max()

943

Print the name of all the columns

In [13]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

What is the data type of each column?

In [14]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

How many different occupations are in this dataset?

In [27]:
len(users.occupation.unique())

21

What is the most frequent occupation?

In [30]:
users.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

Use the `.describe` method to summarize the 'age' column (mean value, max value, min value, etc)

In [33]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

Use the `.describe` method to summarize all the non-numeric columns (unique values,

In [55]:
users.describe(exclude=int)

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

What is the mean age of users?

In [60]:
import math
users.age.mean()

34.05196182396607

 What is the least frequent age?

In [87]:
users.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64